export interface QuestionType {
  label: string;
  choices: ChoiceType[];
}

export interface ChoiceType {
  label: string;
  point: number;
}

const questions: QuestionType[] = [
  {
    label: "ช่วงนี้...เป็นยังไงบ้างนะ",
    choices: [
      {
        label: "ทุกๆวันของฉันผ่านไปอย่างไม่เหนื่อยมากนัก",
        point: 0,
      },
      {
        label: "ทุกวันนี้ฉันมีความสุขดี ",
        point: 1,
      },
      {
        label: "ฉันมีเรื่องให้วิตกกังวลอยู่บ้าง",
        point: 2,
      },
    ],
  },
  {
    label: "หากคุณได้รับดอกไม้มาหนึ่งช่อ จะทำอย่างไรกับมัน",
    choices: [
      {
        label: "นำมาประดับใส่แจกัน ",
        point: 2,
      },
      {
        label: "วางทิ้งไว้เฉย ๆ จนแห้งเหี่ยวไปเอง",
        point: 0,
      },
      {
        label: "นำไปทำให้แห้งและประดับใส่กรอบ",
        point: 1,
      },
    ],
  },
  {
    label: "ถ้าคุณเป็นดอกไม้ คุณคิดว่าคุณจะสวยงามที่สุดตอนไหน",
    choices: [
      {
        label: "ฤดูหนาวที่ขาวโพลนด้วยหิมะ",
        point: 0,
      },
      {
        label: "ฤดูใบไม้ผลิอันร้อนระอุ",
        point: 1,
      },
      {
        label: "ฤดูฝนที่เปียกโชกไปทั้งวัน",
        point: 2,
      },
    ],
  },
  {
    label:
      "หากเพื่อนสนิทที่คุณไม่ได้คุยด้วยมา 10 ปี โทรมาหาคุณ สิ่งที่คุณอยากคุยกับเขามากที่สุดคือ",
    choices: [
      {
        label: "ชีวิตของเขาตอนนี้เป็นอย่างไรบ้าง",
        point: 1,
      },
      {
        label: "คุยถึงเรื่องราวสมัยเด็ก",
        point: 0,
      },
      {
        label: "นัดเขาไปทานข้าวด้วยกันซักที่",
        point: 2,
      },
    ],
  },
  {
    label: "คนอื่นมักบอกคุณว่า",
    choices: [
      {
        label: "คุณมักเป็นคนสดใสร่าเริง",
        point: 1,
      },
      {
        label: "คุณเป็นคนที่แสดงความรู้สึกออกมาอย่างชัดเจน",
        point: 2,
      },
      {
        label: "คุณดูมีเรื่องเครียดหรือเศร้าใจอยู่บ้าง",
        point: 0,
      },
    ],
  },
  {
    label: "สิ่งที่คุณทำเมื่อรู้สึกเศร้า ",
    choices: [
      {
        label: "แชร์เรื่องนี้ให้คนที่คุณไว้ใจฟัง ",
        point: 2,
      },
      {
        label: "เปิดเพลงช้า ๆ นั่งฟัง",
        point: 1,
      },
      {
        label: "ร้องไห้คนเดียวบนเตียง",
        point: 0,
      },
    ],
  },
  {
    label: "ภาพถ่ายที่คุณชอบกลับไปดูมากที่สุด",
    choices: [
      {
        label: "รูปสัตว์หรือโมเม้นต่าง ๆ กับคนรอบตัว",
        point: 1,
      },
      {
        label: "รูปวิวสวยๆที่ถ่ายเก็บไว้ในแต่ละวัน",
        point: 0,
      },
      {
        label: "รูปของคุณที่ถ่ายออกมาถูกใจ",
        point: 2,
      },
    ],
  },
];

export default questions;
