import Image from "next/image";
import { Button } from "@/components/ui/button";
import Link from "next/link";

const PDPA = () => {
  return (
    <section className="space-y-6">
      <div className="bg-white/70 max-w-[1200px] px-7 py-7 space-y-6 rounded">
      <div className="w-full flex flex-col items-center gap-2">
        <div className="mt-8">
          <Image src="/logo.png" alt="logo" width={120} height={120} />
        </div>
        <div className="space-y-4 text-center">
          <h1 className="text-xl font-bold text-[#5a81bc]">แบบฟอร์มลงทะเบียน Mental Health Hackathon Challenge</h1>
          <p>
            Innovation hackathon challenge
            <span className="ml-2 font-semibold text-[#5a81bc]">“นวัตกรรมเพื่อความตระหนักรู้ด้านสุขภาพจิตในสังคม”</span>
          </p>
        </div>
      </div>
      <hr className="p-[1px] bg-[#b9a5d6] w-full"/>
      
      <div className="flex flex-col gap-4">
        <h1 className="text-xl font-bold text-[#5a81bc]">หนังสือยินยอมเพื่อขอใช้ประโยชน์ข้อมูลส่วนบุคคล</h1>
        <h2 className="text-sm">คณะเทคโนโลยีสารสนเทศ มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี</h2>
      <div className="text-xs space-y-3 mb-10">
      <p>
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ทั้งนี้ ท่านมีสิทธิที่จะถอนความยินยอมหรือขอให้คณะ ฯ ลบข้อมูลเมื่อใดก็ได้ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับคณะ ฯ อย่างไรก็ตามการถอนความยินยอมของท่านอาจส่งผลกระทบต่อท่านจากการใช้บริการต่าง ๆ เช่น ท่านจะไม่ได้รับสิทธิประโยชน์ที่ทางคณะ ฯ ให้บริการอยู่ หรือไม่ได้รับข้อมูลข่าวสารอันเป็นประโยชน์แก่ท่าน เป็นต้น ดังนั้นเพื่อประโยชน์ของท่านจึงควรศึกษาและสอบถามถึงผลกระทบ ก่อนเพิกถอนความยินยอมดังกล่าว กรณีที่ท่านต้องการถอนความยินยอมกรุณาติดต่อผ่านอีเมล info@sit.kmutt.ac.th
      </p>
      <ol className="px-3 list-decimal">
        <li>เพื่อประโยชน์ทางการศึกษา การวิเคราะห์ ประมวลผล จัดทำสถิติ รวมไปถึงการจัดบริการต่าง ๆ เช่น การแนะแนว การสมัครงาน การพัฒนาทักษะด้านต่าง ๆ</li>
        <li>เพื่อจัดทำสื่อโฆษณา การเผยแพร่การประชาสัมพันธ์ต่อสาธารณะ ผ่านช่องทางสื่ออิเล็กทรอนิกส์ สื่อออนไลน์ สื่อวิดีโอ สื่อสิ่งพิมพ์ต่าง ๆ เช่น เว็บไซต์ Social Media การติดประกาศ และช่องทางอื่น ๆ</li>
        <li>เพื่อใช้ข้อมูลของท่านในการแจ้งข้อมูลข่าวสาร การเรียนการสอน บริการของคณะ ฯ และการโฆษณาประชาสัมพันธ์ เช่น การเปิดรับสมัครนักศึกษาใหม่ การอบรม หรือกิจกรรมที่เกี่ยวข้อง</li>
        <li>วัตถุประสงค์อื่น ๆ เพื่อประโยชน์ของคณะฯ และ/หรือมหาวิทยาลัย และ/หรือนักศึกษา</li>
      </ol>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;คณะเทคโนโลยีสารสนเทศ มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี ให้ความสำคัญด้านการเคารพสิทธิในความเป็นส่วนตัว และการรักษาความปลอดภัยของข้อมูลส่วนบุคคลของท่าน โดยคณะฯ ได้กำหนดนโยบาย ระเบียบ และหลักเกณฑ์ต่าง ๆ ในการดำเนินงาน ของคณะ ฯ เพื่อให้เป็นไปตามมาตรฐาน ในการรักษาความปลอดภัยของข้อมูลส่วนบุคคล เพื่อให้ท่านได้มั่นใจว่า ข้อมูลส่วนบุคคลของท่านที่คณะ ฯ ได้รับจะถูกนำไปใช้ ตรงตามความต้องการของท่าน และถูกต้องตามกฎหมาย โดยคณะ ฯ จะจัดเก็บข้อมูลส่วนบุคคลของท่านตลอดระยะเวลา ที่จำเป็น ในการดำเนินการตามวัตถุประสงค์ของคณะ ฯ รวมถึงงานต่าง ๆ ที่จำเป็น </p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ทางคณะ ฯ เก็บ รวบรวมและใช้ข้อมูลส่วนบุคคลของท่าน รวมทั้งภาพถ่าย และวีดีโอ ที่เกิดจากการเข้าร่วมกิจกรรมของท่าน ซึ่งจัดโดยมหาวิทยาลัย คณะ ฯ และ/หรือนักศึกษา เพื่อวัตถุประสงค์ของคณะฯ ตลอดจนตามวัตถุประสงค์ดังต่อไปนี้ 
      </p>
      </div>
      </div>
      </div>
      <div className="flex justify-end w-full">
      <Link href='/form/detail' >
        <Button className="text-lg">ยอมรับและถัดไป &gt;</Button>
      </Link>
      </div>
    </section>
  );
};

export default PDPA;
