import React from "react";
import Image from "next/image";
import ArticleBox from "./ArticleBox";

interface Props {
  textStyle: {
    header: string;
    subHeader: string;
    paragraph: string;
  };
  fontColor: {
    blue: string;
    purple: string;
    black: string;
  };
}

const DepressionBox = ({
  textStyle: { header, subHeader, paragraph },
  fontColor: { blue, purple, black },
}: Props) => {
  return (
    <div>
      <div className="flex items-center flex-col gap-5 mt-16">
        <h1 className={`${header} ${blue}`}>9 ข้อสำรวจเข้าข่ายโรคซึมเศร้า</h1>
        <Image
          src="/assets/warning/depression.png"
          alt="depression"
          width={1100}
          height={70}
          className="px-6 md:px-0"
        />
      </div>
      <div className="flex flex-col gap-6 md:gap-20 px-8 md:px-20 mt-10 md:mt-16">
        <div className="space-y-5">
          <h2 className={`${header} ${blue}`}>โรคซึมเศร้าคืออะไร ?</h2>
          <p className={`${paragraph}`}>
            โรคซึมเศร้าเกิดจากความผิดปกติของสมองในส่วนที่มีผลกระทบต่อความคิด
            อารมณ์ ความรู้สึก พฤติกรรม รวมถึงสุขภาพทางกาย
            แต่คนส่วนใหญ่มักคิดว่าโรคซึมเศร้าเกิดจากความผิดหวัง
            หรือการได้รับความกระทบกระเทือนทางจิตใจ
            และจะสามารถรักษาหรือแก้ไขได้ด้วยการให้กำลังใจ ซึ่งในความจริงแล้ว
            โรคซึมเศร้าเป็นโรคที่เกิดจากความไม่สมดุลของสารสื่อประสาท 3 ชนิด คือ
            ซีโรโตนิน นอร์เอปิเนฟริน และโดปามีน
            จึงจำเป็นที่ต้องได้รับการรักษาจากจิตแพทย์
            เพราะนอกจากจะต้องบำบัดอย่างถูกวิธีแล้ว
            ยังอาจจะต้องใช้ยาในการรักษาร่วมด้วย
            โดยปัจจัยเสี่ยงที่จะทำให้ป่วยเป็นโรคซึมเศร้าประกอบไปด้วยพันธุกรรม
            สิ่งแวดล้อม และการใช้ชีวิต
          </p>
        </div>
        <div className="space-y-5">
          <h2 className={`${header} ${blue}`}>9 ข้อสำรวจเข้าข่ายโรคซึมเศร้า</h2>
          <p className={`${paragraph}`}>
            การสังเกตตัวเองหรือคนรอบข้างว่าเข้าข่ายโรคซึมเศร้าหรือไม่
            สามารถตรวจจากข้อสำรวจง่ายๆ 9 ข้อนี้ หากมีอาการ 5 ข้อขึ้นไป
            โดยต้องมีข้อ 1.) และ/หรือข้อ 2.) อยู่ด้วย
            และเป็นยาวนานติดต่อกันเกินกว่า 2 สัปดาห์ ถือว่าเข้าข่ายเสี่ยง
            ควรปรึกษาจิตแพทย์ เพื่อวิเคราะห์และหาแนวทางแก้ไขหรือรักษาต่อไป
          </p>
          <ol className={`${paragraph}`}>
            <li>1. รู้สึกเศร้า เบื่อ ท้อแท้ หรือหงุดหงิดง่ายอย่างต่อเนื่อง</li>
            <li>2. เลิกสนใจสิ่งที่เคยชอบมากๆ หรือไม่อยากทำสิ่งที่เคยชอบทำ</li>
            <li>
              3. พฤติกรรมการกินเปลี่ยนไป กินมากไป กินน้อยไป
              จนทำให้น้ำหนักขึ้นหรือลงผิดปกติ
            </li>
            <li>4. จากที่เคยหลับง่ายก็หลับยากขึ้น หรือไม่ก็นอนมากเกินไป</li>
            <li>5. มีอาการกระวนกระวายหรือเฉื่อยชาที่แสดงออกให้เห็นชัด</li>
            <li>6. รู้สึกหมดเรี่ยวแรง ไม่มีพลัง ไม่อยากลุกขึ้นมาทำอะไรเลย</li>
            <li>7. รู้สึกไร้ค่าหรือรู้สึกผิด โทษตัวเองในทุกๆ เรื่อง</li>
            <li>
              8. ไม่มีสมาธิในการทำสิ่งต่างๆ มีปัญหาเรื่องการคิดหรือตัดสินใจ
            </li>
            <li>9. คิดถึงความตายหรืออยากตาย หรืออยากฆ่าตัวตายบ่อยๆ</li>
          </ol>
        </div>
        <div className="space-y-7">
          <h2 className={`${header} ${blue}`}>ประเภทของโรคซึมเศร้า</h2>
          <p className={`${paragraph}`}>
            โรคซึมเศร้ามีหลายประเภท
            ทำให้ผู้ป่วยซึมเศร้าแต่ละคนมีพฤติกรรมที่แตกต่างกันออกไป เช่น
          </p>
          <div className="space-y-2">
            <h2 className={`${blue} ${subHeader}`}>
              โรคซึมเศร้าแบบเมเจอร์ ดีเพรสชั่น (Major Depression)
            </h2>
            <p className={`${paragraph}`}>
              {" "}
              &emsp;โรคซึมเศร้าชนิดนี้ ผู้ป่วยจะมีอารมณ์ซึมเศร้านานกว่า 2
              สัปดาห์
              โดยมากมักมีอาการเศร้าซึมมากจนไม่มีความสุขหรือไม่สนใจในสิ่งต่างๆ
              ที่เคยชอบ หลับยาก น้ำหนักขึ้นหรือลงฮวบฮาบ รู้สึกหงุดหงิด เหนื่อย
              ไม่มีเรี่ยวแรง รู้สึกไร้ค่า
              ช่วงภาวะซึมเศร้านี้สามารถเกิดในช่วงหลังคลอดได้ และมีอาการหลง
              หูแว่วประสาทหลอนเกิดขึ้นร่วมด้วย ดังนั้นควรเริ่มรักษาตั้งแต่เนิ่นๆ
              เพื่อไม่ให้โรครุนแรงขึ้น
            </p>
          </div>
          <div className="space-y-2">
            <h2 className={`${blue} ${subHeader}`}>
              โรคซึมเศร้าแบบดิสทีเมีย (Dysthymia Depression)
            </h2>
            <p className={`${paragraph}`}>
              &emsp;โรคซึมเศร้าชนิดนี้ ผู้ป่วยจะมีอาการรุนแรงน้อยกว่าชนิด
              เมเจอร์ ดีเพรสชั่น แต่จะมีอาการอย่างต่อเนื่องอย่างน้อย 2 ปี
              อาการไม่รุนแรงถึงขนาดทำอะไรไม่ได้
              เพียงแต่จะรู้สึกไม่อยากอาหารหรือกินมากไป นอนไม่หลับหรือนอนมากไป
              เหนื่อยล้า อ่อนเพลีย หมดแรง ขาดความมั่นใจในตัวเอง ไม่ค่อยมีสมาธิ
              การตัดสินใจแย่ลง และรู้สึกหมดหวัง โรคซึมเศร้าที่เกิดขึ้นก่อนมีระดู
              (Premenstrual  depressive disorder)buttonVariants <br />
              &emsp; ผู้ป่วยจะมีอาการเกิดขึ้นในสัปดาห์สุดท้ายก่อนมีระดู 
              อาการจะดีขึ้นใน 2-3 วันหลังจากมีระดู อาการที่พบบ่อย  คือ 
              อารมณ์แกว่ง  รู้สึกเศร้า  อ่อนไหวง่าย  ขัดแย้งกับคนอื่นง่าย 
              รู้สึกสิ้นหวัง ดูถูกตนเอง  อาจมีอาการวิตกกังวล เครียด นั่งไม่ติด
              สมาธิลดลง  รู้สึกล้า อ่อนเพลีย ไม่อยากทำอะไร 
              ความอยากอาหารเปลี่ยนแปลง การนอนผิดปกติไปจากเดิม 
              และมีอาการทางร่างกายร่วมด้วย เช่น  เจ็บเต้านม  เต้านมบวม
              ปวดข้อปวดกล้ามเนื้อ ตัวบวมขึ้น
            </p>
          </div>
          <div className="space-y-2">
            <h2 className={`${blue} ${subHeader}`}>
              โรคซึมเศร้าที่เกิดขึ้นก่อนมีระดู (Premenstrual depressive
              disorder)
            </h2>
            <p className={`${paragraph}`}>
              {" "}
              &emsp; ผู้ป่วยจะมีอาการเกิดขึ้นในสัปดาห์สุดท้ายก่อนมีระดู
              อาการจะดีขึ้นใน 2-3 วันหลังจากมีระดู อาการที่พบบ่อย คือ
              อารมณ์แกว่ง รู้สึกเศร้า อ่อนไหวง่าย ขัดแย้งกับคนอื่นง่าย
              รู้สึกสิ้นหวัง ดูถูกตนเอง อาจมีอาการวิตกกังวล เครียด นั่งไม่ติด
              สมาธิลดลง รู้สึกล้า อ่อนเพลีย ไม่อยากทำอะไร
              ความอยากอาหารเปลี่ยนแปลง การนอนผิดปกติไปจากเดิม
              และมีอาการทางร่างกายร่วมด้วย เช่น เจ็บเต้านม เต้านมบวม
              ปวดข้อปวดกล้ามเนื้อ ตัวบวมขึ้น
            </p>
          </div>
        </div>
        <div className="space-y-4">
          <h1 className={`${header} ${blue}`}>
            การให้กำลังใจและช่วยเหลือผู้ป่วยโรคซึมเศร้า
          </h1>
          <p className={`${paragraph}`}>
            เมื่อเราพบหรือเป็นผู้ที่อยู่ใกล้ชิดผู้ป่วยโรคซึมเศร้า
            เราควรที่จะเรียนรู้วิธีการที่ทำให้ผู้ป่วยรู้สึกมีค่า
            การให้กำลังใจและเป็นผู้ฟังที่ดีจะช่วยให้ผู้ป่วยรู้สึกผ่อนคลายขึ้น
            ผู้ใกล้ชิดสามารถที่จะสื่อสารกับผู้ป่วยด้วยประโยคเหล่านี้ เช่น
          </p>
          <ol className={`${paragraph}`}>
            <li>• เธอไม่ได้อยู่ตัวคนเดียวนะ ฉันจะอยู่ข้างๆ เธอเอง</li>
            <li>• ฉันอาจจะไม่เข้าใจเธอ แต่ฉันเป็นห่วงและอยากช่วยเธอนะ</li>
            <li>• เธอไหวไหม เธอเหนื่อยมากไหม</li>
            <li>• ชีวิตเธอสําคัญกับฉันมากๆ นะ</li>
            <li>• เธออยากให้เราช่วยอะไรบ้าง บอกได้นะ เราอยากช่วย</li>
          </ol>
          <p className={`${paragraph}`}>
            ข้อความดังกล่าวจะช่วยให้ผู้ป่วยไม่รู้สึกกดดัน
            และได้พูดถึงความคิดของตนได้มากขึ้น
            ส่วนคำที่ชวนให้ผู้ป่วยคิดเปรียบเทียบ
            <br />
            หรือแสดงความไม่เข้าใจว่าทำไม่ถึงต้องซึมเศร้า ยิ่งจะเป็นการซ้ำเติม
            จึงเป็นคำที่ไม่ควรพูด เช่น
          </p>
          <ol className={`${paragraph}`}>
            <li>• ใครๆ ก็เคยผ่านเรื่องแบบนี้ทั้งนั้นแหละ</li>
            <li>• ลองมองในแง่ดีดูสิ</li>
            <li>• ชีวิตมีอะไรอีกตั้งเยอะ ทําไมถึงอยากตายล่ะ</li>
            <li>• หยุดคิดเรื่องที่ทําให้เครียดสิ</li>
            <li>• มีคนที่แย่กว่าเราอีกตั้งเยอะ เขายังสู้ได้เลย</li>
          </ol>
        </div>
        <div className="space-y-4">
          <h1 className={`${header} ${blue}`}>
            ทำอย่างไรจึงห่างไกลโรคซึมเศร้า ?
          </h1>
          <ol className={`${paragraph}`}>
            <li>
              1. หมั่นดูแลตนเองให้มีสุขภาพดี ออกกำลังกายและนอนหลับให้เพียงพอ
              กินอาหารถูกสุขลักษณะ ไม่ใช้สารเสพติด ดื่มเหล้า สูบบุหรี่
              และเข้ารับการตรวจสุขภาพอย่างน้อยปีละครั้ง
            </li>
            <li>
              2. ในด้านจิตใจ ฝึกให้เป็นคนคิดบวก ไม่กล่าวโทษตัวเองไปซะทุกเรื่อง
              ทําสิ่งที่ทำให้รู้สึกตัวเองมั่นใจ มีคุณค่า
              อยู๋ใกล้กับคนที่รักและเป็นห่วงเรา
            </li>
            <li>
              3. ควรหาเวลาออกไปทำกิจกรรมที่สนุกสนาน
              ไม่เคร่งเครียดหรือทำงานหนักเกินไป
              ไม่ไปอยู่ในสถานการณ์หรือดูข่าวร้ายที่ทำให้จิตใจหดหู่
              หากรักษาโรคด้านจิตเวชอยู่ควรกินยาตามแพทย์สั่ง
              อย่าได้ขาดหรือหยุดยาเอง
            </li>
          </ol>
        </div>
        <div className="flex flex-col gap-5">
          <h1 className={`${header} ${purple}`}>บทความอื่น ๆ ที่น่าสนใจ</h1>
          <div className="grid grid-cols-2 gap-4 mb-12">
            <ArticleBox article="stigma" title="การตีตราทางสังคมต่อผู้ป่วยจิตเวช"
            content="“ผู้ป่วยจิตเวชเป็นบุคคลอันตราย ชอบทำร้ายคนอื่น จึงไม่ควรเข้าใกล้” 
            การเหมารวมว่าผู้ป่วยจิตเวชทุกคนเป็นบุคคลอันตราย ซึ่งเห็นได้บ่อยครั้งผ่านการนำเสนอผ่านสื่อหรือการใช้คำพูดล้อเลียนผู้ป่วยจิตเวช เช่น คนบ้า คนไม่เต็มบาท คนไม่สมประกอบ และโรคจิต"
            />
            <ArticleBox article="how-to" title="How to มีสุขภาพจิตที่ดี"
            content="สุขภาพจิตประกอบไปด้วยสุขภาวะทางอารมณ์ ทางกาย และการอยู่ร่วมกันด้วยดี ซึ่งสิ่งเหล่านี้ส่งผลต่อวิธีคิด ความรู้สึก การกระทำ การตัดสินใจ และความสัมพันธ์กับผู้อื่น "
            />
          </div>
        </div>
      </div>
    </div>
  );
};

export default DepressionBox;
